import { get } from "../../main/utils.js";

/** @type { importCharacterConfig['translate'] } */
const translate = {
	wuwu: "呜",
	
	weiji: "威基",
	weiya: "威压",
	weiya_defense: "威压",
	weiya_offense: "威压",
	weiya_info: "锁定技，当你成为其他角色杀或延时锦囊的目标时，其需交给你一张杀或锦囊牌，否则此牌对你无效。当你使用杀或锦囊牌指定其他目标时，其需交给你一张牌，否则此杀不可被响应，锦囊牌不可被无懈可击。",
	
	habenhaimo: "哈本海默",
	zhizi: "智子",
	zhizi_info: "锁定技，当一张锦囊牌被使用时，使用者需进行一次判定，若为♦，该牌无效。",
	liebian: "裂变",
	liebian_info: "在判定牌生效前，你可用一张手牌或核代替之，并将原判定牌置于你的武将牌上作为核标记。当你首次集齐4/8/12个核时，可以摸两张牌。",
	manha: "曼哈",
	manha_info: "限定技，出牌阶段，你可以移除13种点数的核，令一名角色失去7点体力，然后击碎所有角色的勾玉，并各造成一点伤害。",
	
	hashangfei: "哈上飞",
	fufeng: "浮风",
	fufeng_info: "锁定技，若你划拳时扣置的装备牌或锦囊牌无法使用，使对方扣置的杀失效。若你划拳时双方扣置牌均无法使用，双方各摸一张牌。",
	lunzhen: "论真",
	lunzhen_info: "出牌阶段限一次，你可以选择一名手牌数不小于你的角色划拳，直到双方有角色手牌耗尽，手牌耗尽的角色失去一点体力。",
	gefang: "革放",
	gefang_info: "主公技，限定技，回合开始阶段，你可以将全场摸牌规则改为摸当前体力值数量的牌（最多为五）。",
	
	baji: "巴基",
	fucong: "服从",
	fucong_active: "服从",
	fucong_info: "锁定技，其他角色在其出牌阶段限一次，当其手牌、装备、体力三者中有两项大于你时，可以交给你一张杀，视为你对一名其指定的任意角色打出一张杀。",
	xiaohui: "小惠",
	xiaohui_info: "出牌阶段限一次，你可以将一张牌交给一名其他角色，其在你的下个回合开始前不能指定你为杀的目标。",
	zhishi: "指使",
	zhishi_info: "出牌阶段限一次，你可以让一名其他角色对你指定的任意一名角色使用一张杀，然后获得你一张牌；否则其交给你一张牌。",

	hazhentian: "哈震天",
	gehua: "铬化",
	gehua_info: "出牌阶段，你可以废除一种装备栏并弃置两张手牌，然后选择一件对应义体视为装备。",
	chaoxian: "超限",
	chaoxian_info: `出牌阶段，若你没有装备栏，你可以弃置一张牌并减少两点体力上限，任选一件非武器类未装备的义体视为装备，然后获得技能${get.poptip("jieli")}。`,
	jieli: "解离",
	jieli_info: "锁定技，你指定单一目标时需判定一次，若X大于3Y-2，目标改为从你往后第X位且造成伤害时+1。（X为判定牌点数，Y为你的体力上限）",
};

export default translate;
